public/The-CPP-Programming-Language-NOTE.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-12-04 Fri 21:51 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>The-CPP-Programming-Language-NOTE</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Evan Meek">
<link rel="shortcut icon" href="/images/rose-red.png" type="image/x-icon" />
<link rel="stylesheet" href="/css/animate.min.css" />
<link rel="stylesheet" href="/css/all.min.css" />
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">The-CPP-Programming-Language-NOTE</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org85a0339">书中生词/字记录</a></li>
<li><a href="#org5fbb7b0">值得记录的句子</a></li>
</ul>
</div>
</div>

<div id="outline-container-org85a0339" class="outline-2">
<h2 id="org85a0339">书中生词/字记录</h2>
<div class="outline-text-2" id="text-org85a0339">
<ul class="org-ul">
<li>擘划
bo(4) hua(4)</li>
<li>遴选
lin(2) xuan(3)</li>
</ul>
</div>
</div>

<div id="outline-container-org5fbb7b0" class="outline-2">
<h2 id="org5fbb7b0">值得记录的句子</h2>
<div class="outline-text-2" id="text-org5fbb7b0">
<ul class="org-ul">
<li><p>
4th前言-第4段
</p>
<blockquote>
<p>
C++是一种通用程序设计语言，它强调富类型，轻量级抽象的设计和使用。
</p>
</blockquote></li>
<li><p>
4h前言-第2页-第4段-最后一句话
</p>
<blockquote>
<p>
计算机是一种通用机器，而C++在其中起着重要作用。特别是，C++的设计目标就是足够灵活和通用，以便处理那些连它的设计者都未曾想象过的未来难题。
</p>
</blockquote></li>
<li><p>
p6-第7段-第3-4句话
</p>
<blockquote>
<p>
书中的主要程序片段都已在多个C++实现上进行了实验，那些使用了新特性的代码在某些编译器上会编译失败。但我认为指出某某编译器不能编译某某例子没有什么意义，这些信息很快就会过时，因为编译器设计者都在努力工作以确保他们的编译器能正确支持所有C++特性。
</p>
</blockquote></li>
<li><p>
p6-第8段-第1句话
</p>
<blockquote>
<p>
当我发现在某个地方C++11特性最适合时，我就会使用C++11特性。例如，我倾向于使用{}风格的初始化方式以及使用using定义类型别名。有时，这些用法可能会让“老程序员”惊讶。但是，惊讶通常是促使你学习新知识的很好的诱因。
</p>
</blockquote>
<p>
我就是看了FinalCut的示例代码，代码中用到了using定义类型别名和使用{}风格的初始化方式而看不懂才来看这本书的，果然被作者说中了！
</p></li>
<li><p>
p7-第1段-最后一句话
</p>
<blockquote>
<p>
C++的设计理念是同时提供
</p>
<ol class="org-ol">
<li>将内置操作和内置类型直接映射到硬件，从而提供高效的内存利用和高校的底层操作。</li>
<li>灵活且低开销的抽象机制，使得用户自定义类型无论是符号表达，使用范围还是性能都与内置类型相当。</li>
</ol>
</blockquote>
<p>
这应该就是为什么C++十分强大，但执行速度又非常高的原因了吧。
</p></li>
<li><p>
p11-第2段-第1-2句话
</p>
<blockquote>
<p>
我们用来思考/编程的语言与我们能够想象的问题/解决方案的联系是非常紧密的。为此，以消除程序员的错误为目的的限制语言特性是无意义的，最好情况也只是一种危险的理念。
</p>
</blockquote>
<p>
这句话我觉得作者是在抨击一些编程语言，例如很多现代编程语言都提供了动态类型，不再需要指明变量的类型，这算不算是“以消除程序员的错误为目的的限制语言特性”呢？有待思考。
</p></li>
<li><p>
p13-第1段-第2句话
</p>
<blockquote>
<p>
一个精心设计的用户自定义类型与内置类型的区别仅仅在于定义的方式，而使用方式则是完全一样的。
</p>
</blockquote></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-12-04 Fri 00:00</p>
<p class="author">Author: Evan Meek</p>
<p class="date">Created: 2020-12-04 Fri 21:51</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
